{
  "project": "Panta Smart Intake",
  "branchName": "ralph/smart-intake-trucking",
  "description": "4-stage conditional logic form for trucking insurance intake with ACORD PDF generation",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define TypeScript interfaces for SmartIntakeData",
      "description": "As a developer, I need TypeScript interfaces for all form data so that I can reliably map user inputs to ACORD form fields.",
      "acceptanceCriteria": [
        "Create src/types/intake.ts with SmartIntakeData interface",
        "Define knockout interface with 6 boolean fields",
        "Define riskProfile interface with hazmat, radius, fleet, cargo fields",
        "Define business interface with all ACORD 125 required fields",
        "Define operations interface with safety/telematics fields",
        "Define Vehicle interface with year, make, model, vin, bodyType, gvw, statedValue, radius, forHire, lienholder",
        "Define Driver interface with name, dob, license, yearsExperience, violations, accidents",
        "Define priorInsurance interface with carrier, policy, premium, dates",
        "Define lossHistory interface with claims array",
        "Define coveragePreferences interface with limits and deductibles",
        "Define Address interface for reuse",
        "Define Claim, Violation, Accident sub-interfaces",
        "Export all interfaces",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Completed 2026-01-18. Created src/types/intake.ts with all interfaces including SmartIntakeData, Knockout (6 fields), RiskProfile, Business, Operations, Vehicle, Driver, PriorInsurance, LossHistory, CoveragePreferences, Address, Claim, Violation, Accident. All default values exported. TypeScript compilation passes."
    },
    {
      "id": "US-002",
      "title": "Create Zod validation schemas",
      "description": "As a developer, I need Zod schemas to validate form inputs with proper error messages.",
      "acceptanceCriteria": [
        "Create src/lib/validators.ts",
        "Create knockoutSchema with 6 boolean fields",
        "Create riskProfileSchema with conditional hazmatTypes validation",
        "Create businessSchema with FEIN format (XX-XXXXXXX), DOT (7 digits), MC format validation",
        "Create vehicleSchema with VIN validation (17 characters)",
        "Create driverSchema with date validations",
        "Create addressSchema with required street, city, state, zip",
        "Create smartIntakeSchema combining all sub-schemas",
        "Add descriptive error messages for each field",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Completed 2026-01-18. Created src/lib/validators.ts with comprehensive Zod validation schemas. Added zod v3.23.8 dependency. Implemented all schemas: knockoutSchema (6 boolean fields with null for unanswered), riskProfileSchema (with conditional hazmatTypes validation), businessSchema (FEIN XX-XXXXXXX, DOT 7 digits, MC format), vehicleSchema (17-char VIN validation), driverSchema (age 18-100, date formats), addressSchema (required street/city/state/zip). Created smartIntakeSchema combining all sub-schemas. Added descriptive error messages. Exported Zod-inferred types. Created stage validation helper functions. Switched to pnpm due to npm semver issues."
    },
    {
      "id": "US-003",
      "title": "Create useLocalStorage hook",
      "description": "As a trucking owner, I want my form progress saved automatically so I can continue later.",
      "acceptanceCriteria": [
        "Create src/hooks/useLocalStorage.ts",
        "Hook accepts key string and initial value",
        "Hook returns [storedValue, setValue] tuple",
        "Values are JSON serialized to localStorage",
        "Hook handles SSR (check typeof window)",
        "Hook handles JSON parse errors gracefully",
        "Debounce saves by 2 seconds to avoid performance issues",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Completed 2026-01-18. Created src/hooks/useLocalStorage.ts with SSR-safe localStorage persistence using useSyncExternalStore pattern. Implements debounced saves (2 seconds), JSON parse error handling, cross-tab sync via storage events. Also exported useLocalStorageState alternative, clearLocalStorageKey and hasLocalStorageKey utilities."
    },
    {
      "id": "US-004",
      "title": "Create useIntakeForm hook",
      "description": "As a developer, I need a central hook to manage form state across all 4 stages.",
      "acceptanceCriteria": [
        "Create src/hooks/useIntakeForm.ts",
        "Hook uses React Hook Form with Zod resolver",
        "Hook persists form state to localStorage using useLocalStorage",
        "Hook exposes currentStage state (1-4)",
        "Hook exposes goToNextStage and goToPrevStage functions",
        "Hook exposes canProceed function that validates current stage",
        "Hook exposes resetForm function with confirmation",
        "Hook restores saved state on mount",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Completed 2026-01-18. Created src/hooks/useIntakeForm.ts with React Hook Form + Zod resolver integration. Added react-hook-form@7.71.1 and @hookform/resolvers@5.2.2 dependencies. Hook features: currentStage (1-4), goToNextStage/goToPrevStage/goToStage navigation, canProceed validation per stage, getStageErrors, resetForm with confirmation dialog, localStorage persistence via useLocalStorageState, saved state restoration on mount, knockout detection. Also includes STAGE_CONFIG export for UI and helper functions: saveNow, hasSavedProgress, continueFromSaved, startFresh."
    },
    {
      "id": "US-005",
      "title": "Stage 1 - Knockout Questions UI",
      "description": "As a broker, I want to immediately filter out uninsurable applicants so I don't waste time on applications that will be declined.",
      "acceptanceCriteria": [
        "Create src/components/intake/KnockoutStage.tsx",
        "Display 6 knockout questions one at a time with Yes/No toggle buttons",
        "Questions use plain English: 'Has your operating authority (DOT/MC) ever been revoked or suspended?'",
        "If user answers Yes to any question, show decline message with phone number",
        "Decline message: 'Based on your answers, we cannot provide an online quote. Please call us at [phone] to discuss your options.'",
        "If all answers are No, enable Continue button to Stage 2",
        "Use ShadCN Button and Card components",
        "Apply Panta brand colors (Forest Green #0A3F2F, Vibrant Green #22C55E)",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Completed 2026-01-18. Created KnockoutStage component with 6 knockout questions using Yes/No toggle buttons. Questions use plain English without insurance jargon. Shows decline message with phone number when any question answered Yes. Integrated with useIntakeForm hook for state management. Updated page.tsx to use new component architecture. TypeScript compilation passes. Uses existing CSS classes with Panta brand colors."
    },
    {
      "id": "US-006",
      "title": "Stage 2 - Risk Classifier Questions UI",
      "description": "As a broker, I want to classify the risk profile early to determine if this is a Standard or E&S market submission.",
      "acceptanceCriteria": [
        "Create src/components/intake/RiskClassifierStage.tsx",
        "Display 8 risk classifier questions with multiple-choice buttons",
        "Hazmat question shows type selector if Yes (Flammables, Corrosives, Explosives, Radioactive, Other)",
        "Farthest travel question flags Long Haul if >500 miles",
        "Fleet size >10 shows fleet discount eligibility note",
        "Lease-on selection shows 'Motor Carrier you lease to' field",
        "Refrigerated cargo asks about reefer breakdown coverage",
        "Trailer interchange Yes shows count, zones, radius fields",
        "New venture and >2 accidents flag for E&S market",
        "Cargo options: General Freight, Refrigerated, Dry Van, Flatbed, Tanker, Auto Hauler, Household Goods, Intermodal, Oversized, Other",
        "Store E&S flags in form state",
        "Progress indicator shows 'Step 2 of 4'",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Completed 2026-01-19. Created RiskClassifierStage component with all 8 risk classifier questions: hazmat (with conditional types selector for Flammables/Corrosives/Explosives/Radioactive/Other), farthest travel distance (Local/Regional/Long Regional/Long Haul with info note for Long Haul), fleet size (with fleet discount note when >10), cargo types multi-select (10 options: General Freight, Refrigerated, Dry Van, Flatbed, Tanker, Auto Hauler, Household Goods, Intermodal, Oversized, Other), lease-on (with conditional motor carrier field), refrigerated cargo (with conditional reefer breakdown coverage), trailer interchange (with conditional count/zones/radius fields), new venture and accidents. E&S market warning displays when newVenture=true OR accidents>2. Integrated into page.tsx. TypeScript compilation passes."
    },
    {
      "id": "US-007",
      "title": "Stage 3.1 - Business Information Section",
      "description": "As a trucking owner, I want to enter my business details in plain English without insurance jargon.",
      "acceptanceCriteria": [
        "Create src/components/intake/BusinessInfoSection.tsx",
        "Collapsible section titled 'Business Information'",
        "Legal business name (text input, required)",
        "DBA (text input, optional)",
        "Business mailing address with autocomplete",
        "Business phone with formatting",
        "FEIN with format validation XX-XXXXXXX",
        "Entity type radio buttons: LLC, Corporation, Sole Proprietor, Partnership, Other",
        "Website (optional)",
        "Date business started (date picker)",
        "USDOT Number (7 digits, required)",
        "MC Number (optional, format MC-XXXXXX)",
        "Annual gross revenue with $ formatting",
        "Full-time and part-time employee counts",
        "Garaging address toggle with conditional fields",
        "Use ShadCN Input, RadioGroup, DatePicker components",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Completed 2026-01-19. Created src/components/intake/BusinessInfoSection.tsx with collapsible section UI. Implemented all fields: legal name, DBA, mailing address, phone (auto-formatted), FEIN (XX-XXXXXXX format), entity type selector (5 options), website, date started, DOT number (7 digits), MC number (MC-XXXXXX format), annual revenue (currency formatted), employee counts, garaging address toggle with conditional fields. Uses existing CSS classes. TypeScript compilation passes."
    },
    {
      "id": "US-008",
      "title": "Stage 3.2 - Operations & Safety Section",
      "description": "As a trucking owner, I want to describe my operations and safety programs.",
      "acceptanceCriteria": [
        "Create src/components/intake/OperationsSafetySection.tsx",
        "Collapsible section titled 'Operations & Safety'",
        "Cargo description textarea with placeholder example",
        "States of operation multi-select checkboxes",
        "Safety program Yes/No with conditional checkboxes (Safety Manual, Safety Director, Monthly Meetings, OSHA)",
        "Vehicle maintenance program Yes/No",
        "Telematics/ELD Yes/No with conditional checkboxes (Driver Safety, Fuel Tracking, Maintenance Alerts, Mileage, GPS)",
        "If telematics Yes, show fleet percentage slider 0-100%",
        "MVR checks before hiring Yes/No",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Completed 2026-01-19. Created src/components/intake/OperationsSafetySection.tsx with collapsible section UI. Implemented all fields: cargo description textarea with placeholder, states of operation multi-select (all 50 states + DC), safety program Yes/No with conditional checkboxes (Safety Manual, Safety Director, Monthly Meetings, OSHA Compliance), vehicle maintenance program Yes/No, telematics/ELD Yes/No with conditional checkboxes (Driver Safety, Fuel Tracking, Maintenance Alerts, Mileage Tracking, GPS Tracking), fleet percentage slider 0-100% when telematics=Yes, MVR checks before hiring Yes/No. Integrated into page.tsx Stage 3. TypeScript compilation passes. App verified running in browser."
    },
    {
      "id": "US-009",
      "title": "Stage 3.3 - Vehicle Schedule Section",
      "description": "As a trucking owner, I want to add my trucks with all required details.",
      "acceptanceCriteria": [
        "Create src/components/intake/VehicleScheduleSection.tsx",
        "Collapsible section titled 'Your Trucks'",
        "Add Truck button to add vehicles dynamically",
        "Per truck: Year dropdown (1990-2026), Make with autocomplete, Model, VIN (17 chars)",
        "Body type dropdown: Tractor, Straight Truck, Box Truck, Flatbed, Tanker, Dump Truck, Other",
        "GVW in pounds, Stated Value with $ formatting",
        "Garaging address with default to business address option",
        "Radius radio buttons: Local (<50mi), Regional (50-200), Long Regional (200-500), Long Haul (500+)",
        "For hire Yes/No, Lienholder Yes/No with conditional name/address",
        "Show running count: 'X trucks added'",
        "Remove truck button on each entry",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Completed 2026-01-19. Created src/components/intake/VehicleScheduleSection.tsx with comprehensive vehicle schedule functionality. Implemented dynamic add/remove vehicles, year dropdown (1990-2027), make/model text inputs, VIN validation (17 chars), body type selector (7 options: Tractor, Straight Truck, Box Truck, Flatbed, Tanker, Dump Truck, Other), GVW and stated value with formatting, radius of operation (4 options: Local, Regional, Long Regional, Long Haul), for-hire Yes/No, garaging address toggle with conditional fields, lienholder toggle with conditional name/address fields. Running count displays 'X trucks added' in section header. Integrated into page.tsx Stage 3. TypeScript compilation passes."
    },
    {
      "id": "US-010",
      "title": "Stage 3.4 - Driver Section",
      "description": "As a trucking owner, I want to add my drivers with their experience and history.",
      "acceptanceCriteria": [
        "Create src/components/intake/DriverSection.tsx",
        "Collapsible section titled 'Your Drivers'",
        "Add Driver button to add drivers dynamically",
        "Per driver: Full name, DOB, License number, License state dropdown",
        "Years of CDL experience, Date hired",
        "Accidents in last 3 years Yes/No with conditional: Date, Description, At-fault Yes/No",
        "Moving violations in last 3 years Yes/No with conditional: Date, Type dropdown, Location",
        "Violation types: Speeding, Reckless Driving, DUI/DWI, Logbook Violation, Other",
        "Show running count: 'X drivers added'",
        "Remove driver button on each entry",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Completed 2026-01-19. Created src/components/intake/DriverSection.tsx with comprehensive driver information collection. Implemented dynamic add/remove drivers, all required fields (full name, DOB, license number, license state dropdown with all US states + DC), years of CDL experience, date hired. Conditional accidents section with Yes/No toggle, dynamic add/remove accidents with date, description, at-fault fields. Conditional violations section with Yes/No toggle, dynamic add/remove violations with date, type dropdown (5 options: Speeding, Reckless Driving, DUI/DWI, Logbook Violation, Other), and location fields. Running count displays 'X drivers added' in collapsible section header. Remove button on each driver card. Integrated into page.tsx Stage 3. TypeScript compilation passes."
    },
    {
      "id": "US-011",
      "title": "Stage 3.5 - Prior Insurance & Claims Section",
      "description": "As a trucking owner, I want to provide my insurance history and claims.",
      "acceptanceCriteria": [
        "Create src/components/intake/PriorInsuranceSection.tsx",
        "Collapsible section titled 'Prior Insurance & Claims History'",
        "Currently insured Yes/No",
        "If Yes: Carrier name, Policy number, Annual premium, Effective date, Expiration date",
        "Why shopping dropdown: Renewal coming up, Want better rates, Need higher limits, Non-renewed, Cancelled, Other",
        "Claims in last 5 years Yes/No",
        "If Yes, add claims dynamically: Date of loss, Type dropdown, Amount paid, Amount reserved, Still open Yes/No, Description",
        "Claim types: Collision, Cargo Damage, Bodily Injury Liability, Property Damage Liability, Comprehensive, Other",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 11,
      "passes": true,
      "notes": "Completed 2026-01-19. Created src/components/intake/PriorInsuranceSection.tsx with comprehensive prior insurance and claims history collection. Implemented all fields: currently insured Yes/No toggle, conditional current insurance details (carrier name, policy number, annual premium with currency formatting, effective date, expiration date), why shopping selector (6 options: renewal_coming_up, want_better_rates, need_higher_limits, non_renewed, cancelled, other), claims in last 5 years Yes/No toggle, dynamic claims array with add/remove functionality. Per claim: date of loss, type dropdown (6 types: Collision, Cargo Damage, Bodily Injury Liability, Property Damage Liability, Comprehensive, Other), amount paid/reserved with currency formatting, still open Yes/No, description textarea. Collapsible section UI matching BusinessInfoSection pattern. Integrated into page.tsx Stage 3 after DriverSection. TypeScript compilation passes. Fixed field name mappings to match intake.ts types (carrierName not currentCarrier, shoppingReason not whyShopping, dateOfLoss not date)."
    },
    {
      "id": "US-012",
      "title": "Stage 3.6 - Coverage Preferences Section",
      "description": "As a trucking owner, I want to specify my desired coverage limits and deductibles.",
      "acceptanceCriteria": [
        "Create src/components/intake/CoveragePreferencesSection.tsx",
        "Collapsible section titled 'Coverage Preferences'",
        "Liability limit radio buttons with descriptions: $1M CSL (Most Common), $750K, $500K, Other",
        "Comprehensive deductible radio: $1000, $2500, $5000, Other",
        "Collision deductible radio: $1000, $2500, $5000, Other",
        "Hired auto coverage Yes/No with tooltip",
        "Non-owned auto coverage Yes/No with tooltip",
        "Progress indicator shows 'Step 3 of 4'",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 12,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Stage 4 - Document Upload Gate",
      "description": "As a broker, I want to require certain documents before submission so the application is complete.",
      "acceptanceCriteria": [
        "Create src/components/intake/DocumentGateStage.tsx",
        "Required documents section: Loss Runs (with tooltip), MC/DOT Authority Letter (with tooltip)",
        "Optional documents: Vehicle Schedule, Driver List, Current Dec Page, IFTA Credentials",
        "Drag-and-drop upload zone using react-dropzone",
        "Accept PDF, JPG, PNG only",
        "10MB file size limit per file with validation",
        "Show upload progress and success confirmation",
        "Show 'All required documents uploaded' checkmark when complete",
        "Submit button only enabled when required docs uploaded",
        "Progress indicator shows 'Step 4 of 4'",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 13,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Progress Indicator & Stage Navigation",
      "description": "As a trucking owner, I want to see my progress and navigate between stages.",
      "acceptanceCriteria": [
        "Create src/components/intake/ProgressIndicator.tsx",
        "Show current stage (1 of 4, 2 of 4, etc.)",
        "Stage names: Quick Questions, Your Risk Profile, Business Details, Upload Documents",
        "Visual progress bar with Panta brand colors",
        "Back button to return to previous stages",
        "Save & Continue Later button with confirmation message",
        "On return, detect saved state and prompt 'Welcome back! Continue where you left off?'",
        "Start Over button with confirmation dialog",
        "Mobile-responsive design",
        "Form validates each section before allowing progression",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 14,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "ACORD Field Mappings Utility",
      "description": "As a developer, I need a utility to map form data to ACORD PDF field names.",
      "acceptanceCriteria": [
        "Create src/lib/acord-mappings.ts",
        "Define ACORD_125_FIELD_MAP object mapping SmartIntakeData paths to ACORD 125 field names",
        "Define ACORD_127_FIELD_MAP object mapping to ACORD 127 field names",
        "Define ACORD_129_FIELD_MAP for vehicle schedule overflow",
        "Create mapToAcord125(data: SmartIntakeData) function returning field/value pairs",
        "Create mapToAcord127(data: SmartIntakeData) function returning field/value pairs",
        "Handle entity type checkbox mapping",
        "Handle loss history table mapping",
        "Handle driver table mapping",
        "Handle vehicle table mapping",
        "Typecheck passes"
      ],
      "priority": 15,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "ACORD 125 PDF Generation",
      "description": "As a broker, I want the system to auto-generate a filled ACORD 125 PDF.",
      "acceptanceCriteria": [
        "Create src/lib/pdf/acord125Generator.ts",
        "Use pdf-lib to fill ACORD 125 template",
        "Map business.legalName to Named Insured",
        "Map business.mailingAddress to Mailing Address",
        "Map business.phone, fein, entityType, website",
        "Map business.dateStarted, annualRevenue, employees",
        "Map operations.description with DOT/MC numbers",
        "Map priorInsurance fields to Prior Carrier section",
        "Map lossHistory.claims to Loss History table",
        "Check Truckers and Motor Carrier under Lines of Business",
        "Mark knockout questions as No (they passed)",
        "Return filled PDF as Uint8Array",
        "Typecheck passes"
      ],
      "priority": 16,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-017",
      "title": "ACORD 127 PDF Generation",
      "description": "As a broker, I want the system to auto-generate a filled ACORD 127 PDF with driver and vehicle info.",
      "acceptanceCriteria": [
        "Create src/lib/pdf/acord127Generator.ts",
        "Use pdf-lib to fill ACORD 127 template",
        "Map drivers array to Driver table (name, DOB, license, state, experience, date hired)",
        "Map drivers violations to Q14 detail section",
        "Map riskProfile.hazmat to Q7",
        "Map operations.hasMaintenanceProgram to Q3",
        "Map operations.checksMVRs to Q10",
        "Map operations.hasTelematics to Q17",
        "Map vehicles array to Vehicle table (year, make, model, VIN, body, GVW, radius, value, garaging)",
        "Map vehicles[].lienholder to Additional Interest section",
        "If >4 vehicles, set flag for ACORD 129 generation",
        "Return filled PDF as Uint8Array",
        "Typecheck passes"
      ],
      "priority": 17,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-018",
      "title": "ACORD 129 Vehicle Schedule PDF",
      "description": "As a broker, I need overflow vehicle schedule when there are more than 4 trucks.",
      "acceptanceCriteria": [
        "Create src/lib/pdf/acord129Generator.ts",
        "Use pdf-lib to fill ACORD 129 template",
        "Only generate if vehicles.length > 4",
        "Map vehicles 5+ to continuation schedule",
        "Include all vehicle fields: year, make, model, VIN, body type, GVW, value, garaging",
        "Handle multiple pages if needed",
        "Return filled PDF as Uint8Array or null if not needed",
        "Typecheck passes"
      ],
      "priority": 18,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-019",
      "title": "ZIP Package Generation & Download",
      "description": "As a broker, I want to download a complete submission packet ZIP file ready for underwriters.",
      "acceptanceCriteria": [
        "Create src/lib/pdf/zipPackager.ts",
        "Use JSZip to create submission package",
        "Include ACORD_125_[BusinessName].pdf",
        "Include ACORD_127_[BusinessName].pdf",
        "Include ACORD_129_[BusinessName].pdf if applicable",
        "Include uploaded documents with clear names (Loss_Runs_[BusinessName].pdf, etc.)",
        "ZIP filename: Panta_Submission_[BusinessName]_[Date].zip",
        "Create src/components/intake/DownloadPacket.tsx",
        "Show download button after all PDFs generated",
        "Show success message: 'Your submission packet is ready!'",
        "Show document count: 'X documents in packet'",
        "Trigger browser download on click",
        "Typecheck passes",
        "Verify in browser using native Claude Code browser tool"
      ],
      "priority": 19,
      "passes": false,
      "notes": ""
    }
  ]
}